### Import necessary Libraries

In [2]:
import pandas as pd
import numpy as np

### Importing Dummy Dataset

In [3]:
df = pd.read_csv("Dummy_Dataset.csv")
df.head(5)

      Name  Age  Height_cm  Weight_kg   Department  Score
0    Alice   25        165         55        Sales     88
1      Bob   30        180         85  Engineering     92
2  Charlie   35        175         78           HR     95
3    Diana   40        160         60  Engineering     70
4      Eve   22        155         50        Sales     85

### Group Data

In [7]:
df_grouped = df.groupby("Department")

# Size of each group
print("\nSize of each group:\n" , df_grouped.size())

Size of each group:
 Department
Engineering    3
HR             2
Marketing      2
Sales          3
dtype: int64

In [ ]:
# Mean Score by Department
print("\nMean Score by Department\n" , df_grouped["Score"].mean())

Mean Score by Department
 Department
Engineering    79.333333
HR             87.000000
Marketing      79.500000
Sales          85.666667
Name: Score, dtype: float64

In [ ]:
# Cumulative some of scores within each group - the running total for that group
print("\nCumulative some of scores within each group:\n", df_grouped["Score"].cumsum())

Cumulative some of scores within each group:
 0     88
1     92
2     95
3    162
4    173
5    174
6     91
7    159
8    238
9    257
Name: Score, dtype: int64

In [10]:
# Rank within group
df["Score_Rank"] = df_grouped["Score"].rank(ascending = False)
print("\nScore ranks within department:\n" , df[["Name", "Department", "Score", "Score_Rank"]])

Score ranks within department:
       Name   Department  Score  Score_Rank
0    Alice        Sales     88         1.0
1      Bob  Engineering     92         1.0
2  Charlie           HR     95         1.0
3    Diana  Engineering     70         3.0
4      Eve        Sales     85         2.0
5    Frank           HR     79         2.0
6    Grace    Marketing     91         1.0
7     Hank    Marketing     68         2.0
8      Ivy  Engineering     76         2.0
9     Jack        Sales     84         3.0

### Summarize Data

In [ ]:
# Value counts of department - how many times each unique value appears in the Department column
print("\nValue counts of department:\n" , df["Department"].value_counts())

Value counts of department:
 Department
Sales          3
Engineering    3
HR             2
Marketing      2
Name: count, dtype: int64

In [13]:
# Dataframe info
print("\nInformation about the dataframe:\n" , df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        10 non-null     object
 1   Age         10 non-null     int64
 2   Height_cm   10 non-null     int64
 3   Weight_kg   10 non-null     int64
 4   Department  10 non-null     object
 5   Score       10 non-null     int64
 6   Score_Rank  10 non-null     float64
dtypes: float64(1), int64(4), object(2)
memory usage: 692.0+ bytes

Information about the dataframe:
 None

In [14]:
# Statistical info about the dataset
print("\nDescriptive Stats:\n" , df.describe())

Descriptive Stats:
              Age  Height_cm  Weight_kg     Score  Score_Rank
count  10.000000   10.00000  10.000000  10.00000   10.000000
mean   30.900000  169.00000  68.800000  82.80000    1.800000
std     5.743595    9.46338  14.366628   9.29516    0.788811
min    22.000000  155.00000  50.000000  68.00000    1.000000
25%    26.750000  161.25000  56.250000  76.75000    1.000000
50%    30.500000  169.00000  69.000000  84.50000    2.000000
75%    34.500000  176.50000  79.500000  90.25000    2.000000
max    40.000000  182.00000  90.000000  95.00000    3.000000

In [17]:
# Tuple of # of rows and # of columns
print("\nNumber of Rows & Columns:\n" , df.shape)

Number of Rows & Columns:
 (10, 7)

In [29]:
# data type of each variable
print(df.dtypes)

# sums values of each obj
df["Age"].sum()

# quantiles of each obj
df["Age"].quantile([0.25, 0.75])

Name           object
Age             int64
Height_cm       int64
Weight_kg       int64
Department     object
Score           int64
Score_Rank    float64
dtype: object

0.25    26.75
0.75    34.50
Name: Age, dtype: float64

### Handling Missing Data

In [32]:
# Introducing some NaNs for learning

df_with_nan = df.copy()
df_with_nan.loc[2, "Score"] = np.nan
df_with_nan.loc[5, "Weight_kg"] = np.nan

In [33]:
print("\nWith Nan's:\n" , df_with_nan)

With Nan's:
       Name  Age  Height_cm  Weight_kg   Department  Score  Score_Rank
0    Alice   25        165       55.0        Sales   88.0         1.0
1      Bob   30        180       85.0  Engineering   92.0         1.0
2  Charlie   35        175       78.0           HR    NaN         1.0
3    Diana   40        160       60.0  Engineering   70.0         3.0
4      Eve   22        155       50.0        Sales   85.0         2.0
5    Frank   29        170        NaN           HR   79.0         2.0
6    Grace   33        168       65.0    Marketing   91.0         1.0
7     Hank   38        182       90.0    Marketing   68.0         2.0
8      Ivy   26        158       52.0  Engineering   76.0         2.0
9     Jack   31        177       80.0        Sales   84.0         3.0

In [34]:
# Drop rows with Nan
print("\nDrop Nan:\n" , df_with_nan.dropna())

Drop Nan:
     Name  Age  Height_cm  Weight_kg   Department  Score  Score_Rank
0  Alice   25        165       55.0        Sales   88.0         1.0
1    Bob   30        180       85.0  Engineering   92.0         1.0
3  Diana   40        160       60.0  Engineering   70.0         3.0
4    Eve   22        155       50.0        Sales   85.0         2.0
6  Grace   33        168       65.0    Marketing   91.0         1.0
7   Hank   38        182       90.0    Marketing   68.0         2.0
8    Ivy   26        158       52.0  Engineering   76.0         2.0
9   Jack   31        177       80.0        Sales   84.0         3.0

In [35]:
# Fill Nan
print("\nFill Nan with 0:\n" , df_with_nan.fillna(0))

Fill Nan with 0:
       Name  Age  Height_cm  Weight_kg   Department  Score  Score_Rank
0    Alice   25        165       55.0        Sales   88.0         1.0
1      Bob   30        180       85.0  Engineering   92.0         1.0
2  Charlie   35        175       78.0           HR    0.0         1.0
3    Diana   40        160       60.0  Engineering   70.0         3.0
4      Eve   22        155       50.0        Sales   85.0         2.0
5    Frank   29        170        0.0           HR   79.0         2.0
6    Grace   33        168       65.0    Marketing   91.0         1.0
7     Hank   38        182       90.0    Marketing   68.0         2.0
8      Ivy   26        158       52.0  Engineering   76.0         2.0
9     Jack   31        177       80.0        Sales   84.0         3.0

### Make New Columns

In [40]:
# Add a new computed column
df = df.assign(BMI=lambda d: d["Weight_kg"] / ((d["Height_cm"] / 100) ** 2))

In [42]:
# Categorize Age into buckets - Bin column into n buckets
df["AgeGroup"] = pd.cut(df["Age"], bins=[20, 30, 40], labels=["Young", "Mid-Age"])

print("\nNew Columns (BMI and AgeGroup):\n", df[["Name", "Age", "BMI", "AgeGroup"]])

New Columns (BMI and AgeGroup):
       Name  Age        BMI AgeGroup
0    Alice   25  20.202020    Young
1      Bob   30  26.234568    Young
2  Charlie   35  25.469388  Mid-Age
3    Diana   40  23.437500  Mid-Age
4      Eve   22  20.811655    Young
5    Frank   29  25.259516    Young
6    Grace   33  23.030045  Mid-Age
7     Hank   38  27.170632  Mid-Age
8      Ivy   26  20.829995    Young
9     Jack   31  25.535446  Mid-Age

### Combine Dataset

In [46]:
# Sample dataset to simulate joins
adf = pd.DataFrame({
    "x1": ["A", "B", "C"],
    "x2" : [1,2,3]
})

bdf = pd.DataFrame({
    "x1": ["B", "C", "D"], 
    "x3": ["Beta", "Gamma", "Delta"]
})

In [ ]:
# Inner join - It retains only the rows that have matching values in the 'x1' column of both DataFrames (adf and bdf)
print("\nInner Join:\n" , pd.merge(adf, bdf, how = "inner", on = "x1"))

Inner Join:
   x1  x2     x3
0  B   2   Beta
1  C   3  Gamma

In [ ]:
# Outer Join -  It keeps all rows from both DataFrames (adf and bdf)
print("\nOuter Join:\n", pd.merge(adf, bdf, how="outer", on="x1"))

Outer Join:
   x1   x2     x3
0  A  1.0    NaN
1  B  2.0   Beta
2  C  3.0  Gamma
3  D  NaN  Delta

In [ ]:
# Left Join - It keeps all rows from the left DataFrame (adf)
# It attempts to find matching rows in the right DataFrame (bdf) based on the 'x1' column.
print("\nLeft Join:\n", pd.merge(adf, bdf, how="left", on="x1"))

Left Join:
   x1  x2     x3
0  A   1    NaN
1  B   2   Beta
2  C   3  Gamma

In [ ]:
# Right Join - It keeps all rows from the right DataFrame (bdf)
# It attempts to find matching rows in the left DataFrame (adf) based on the 'x1' column
print("\nRight Join:\n", pd.merge(adf, bdf, how="right", on="x1"))

Right Join:
   x1   x2     x3
0  B  2.0   Beta
1  C  3.0  Gamma
2  D  NaN  Delta

In [ ]:
# Filtering Join - Keep matches only - All rows in adf that do not have a match in bdf
print("\nFiltering Join (Only in adf):\n", adf[adf["x1"].isin(bdf["x1"])])

Filtering Join (Only in adf):
   x1  x2
1  B   2
2  C   3

### Set-like Merge Operation

In [52]:
ydf = pd.DataFrame({"merge1": ["A", "B", "C"]})
zdf = pd.DataFrame({"merge1": ["B", "C", "D"]})

In [ ]:
# Intersection - Rows that appear in both ydf and zdf
print("\nIntersection:\n", pd.merge(ydf, zdf))

Intersection:
   merge1
0      B
1      C

In [56]:
# Left Only
left_only = pd.merge(ydf, zdf, how="outer", indicator=True)
print(left_only)

  merge1      _merge
0      A   left_only
1      B        both
2      C        both
3      D  right_only

In [57]:
print("\nLeft Only:\n", left_only.query("_merge == 'left_only'").drop(columns=["_merge"]))

Left Only:
   merge1
0      A

### Rolling and Expanding Windows

In [ ]:
# Simulate rolling average on Score

# It creates a "rolling window" of size 3. For each row in the "Score" column, this window will 
# look at the current value and the two preceding values.
df["Rolling_Score"] = df["Score"].rolling(3).mean()
print("\nRolling Avg of Score (window=3):\n", df[["Name", "Score", "Rolling_Score"]])

Rolling Avg of Score (window=3):
       Name  Score  Rolling_Score
0    Alice     88            NaN
1      Bob     92            NaN
2  Charlie     95      91.666667
3    Diana     70      85.666667
4      Eve     85      83.333333
5    Frank     79      78.000000
6    Grace     91      85.000000
7     Hank     68      79.333333
8      Ivy     76      78.333333
9     Jack     84      76.000000

In [ ]:
# Expanding mean on Score

# For each row in the DataFrame, the "Expanding Score" will contain the average of all "Score" values
#  from the beginning of the DataFrame up to that row. 
df["Expanding_Score"] = df["Score"].expanding().mean()
print("\nExpanding Avg of Score:\n", df[["Name", "Score", "Expanding_Score"]])

Expanding Avg of Score:
       Name  Score  Expanding_Score
0    Alice     88        88.000000
1      Bob     92        90.000000
2  Charlie     95        91.666667
3    Diana     70        86.250000
4      Eve     85        86.000000
5    Frank     79        84.833333
6    Grace     91        85.714286
7     Hank     68        83.500000
8      Ivy     76        82.666667
9     Jack     84        82.800000